projects/09_wind_turbine_blade/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Domain: 3m x 2m x 0.1m (quasi-2D)
// MRF rotor zone will be centered at (1.0, 0.5, 0) with radius 0.3m

scale   1;

vertices
(
    (0   0   0)      // 0
    (3   0   0)      // 1
    (3   2   0)      // 2
    (0   2   0)      // 3
    (0   0   0.1)    // 4
    (3   0   0.1)    // 5
    (3   2   0.1)    // 6
    (0   2   0.1)    // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (150 100 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    topAndBottom
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (0 1 5 4)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
